MinhazRaufoon/ASE-Praktikum-Units/Unit 2/Lab/SPC56ELxx_RLA CAN Test Application for DiscoveryPlus/components/spc56elxx_low_level_drivers_component_rla/lib/include/pwm_lld.h
/*
    SPC5 RLA - Copyright (C) 2015 STMicroelectronics

    Licensed under the Apache License, Version 2.0 (the "License").
    You may not use this file except in compliance with the License.
    You may obtain a copy of the License at

        http://www.apache.org/licenses/LICENSE-2.0

    Unless required by applicable law or agreed to in writing, software
    distributed under the License is distributed on an "AS IS" BASIS,
    WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
    See the License for the specific language governing permissions and
    limitations under the License.
*/

/**
 * @file    pwm_lld.h
 * @brief   SPC5xx PWM low level driver header.
 *
 * @addtogroup PWM
 * @{
 */

#ifndef _PWM_LLD_H_
#define _PWM_LLD_H_

#include "spc5_lld.h"
#include "lldconf.h"

#if (LLD_USE_PWM == TRUE) || defined(__DOXYGEN__)

#include "spc5_flexpwm.h"

/*===========================================================================*/
/* Driver constants.                                                         */
/*===========================================================================*/

/**
 * @name    PWM output mode macros
 * @{
 */
/**
 * @brief   Standard output modes mask.
 */
#define PWM_OUTPUT_MASK                     0x0FU

/**
 * @brief   Output not driven, callback only.
 */
#define PWM_OUTPUT_DISABLED                 0x00U

/**
 * @brief   Positive PWM logic, active is logic level one.
 */
#define PWM_OUTPUT_ACTIVE_HIGH              0x01U

/**
 * @brief   Inverse PWM logic, active is logic level zero.
 */
#define PWM_OUTPUT_ACTIVE_LOW               0x02U
/** @} */

/**
 * @name    STS register bits definitions
 * @{
 */
#define SPC5_FLEXPWM_STS_CMPF0              (1UL << 0)
#define SPC5_FLEXPWM_STS_CMPF1              (1UL << 1)
#define SPC5_FLEXPWM_STS_CMPF2              (1UL << 2)
#define SPC5_FLEXPWM_STS_CMPF3              (1UL << 3)
#define SPC5_FLEXPWM_STS_CMPF4              (1UL << 4)
#define SPC5_FLEXPWM_STS_CMPF5              (1UL << 5)
#define SPC5_FLEXPWM_STS_CFX0               (1UL << 6)
#define SPC5_FLEXPWM_STS_CFX1               (1UL << 7)
#define SPC5_FLEXPWM_STS_RF                 (1UL << 12)
#define SPC5_FLEXPWM_STS_REF                (1UL << 13)
#define SPC5_FLEXPWM_STS_RUF                (1UL << 14)
/** @} */

/**
 * @name    PSC values definition
 * @{
 */
#define SPC5_FLEXPWM_PSC_1                  0U
#define SPC5_FLEXPWM_PSC_2                  1U
#define SPC5_FLEXPWM_PSC_4                  2U
#define SPC5_FLEXPWM_PSC_8                  3U
#define SPC5_FLEXPWM_PSC_16                 4U
#define SPC5_FLEXPWM_PSC_32                 5U
#define SPC5_FLEXPWM_PSC_64                 6U
#define SPC5_FLEXPWM_PSC_128                7U
/** @} */

/**
 * @brief   Max number of PWM channels per PWM driver.
 */
#define PWM_CHANNELS                        8

/**
 * @brief   Complementary output modes mask.
 * @note    This is an SPC5-specific setting.
 */
#define PWM_COMPLEMENT_OUT_MASK             0xF0U

/**
 * @brief   Complementary output not driven.
 * @note    This is an SPC5-specific setting.
 */
#define PWM_COMPLEMENT_OUT_DISABLED         0x00U

/**
 * @brief   Complementary output, active is logic level one.
 * @note    This is an SPC5-specific setting.
 */
#define PWM_COMPLEMENT_OUT_ACTIVE_HIGH      0x10U

/**
 * @brief   Complementary output, active is logic level zero.
 * @note    This is an SPC5-specific setting.
 */
#define PWM_COMPLEMENT_OUT_ACTIVE_LOW       0x20U

/**
 * @brief   Alignment mode mask.
 * @note    This is an SPC5-specific setting.
 */
#define PWM_ALIGN_MASK                      0x01U

/**
 * @brief   Edge-Aligned PWM functional mode.
 * @note    This is an SPC5-specific setting.
 */
#define PWM_ALIGN_EDGE                      0x00U

/**
 * @brief   Center-Aligned PWM functional mode.
 * @note    This is an SPC5-specific setting.
 */
#define PWM_ALIGN_CENTER                    0x01U

/*===========================================================================*/
/* Driver pre-compile time settings.                                         */
/*===========================================================================*/

/**
 * @name    Configuration options
 * @{
 */
/**
 * @brief   PWMD1 driver enable switch.
 * @details If set to @p TRUE the support for PWMD1 is included.
 * @note    The default is @p FALSE.
 */
#if !defined(SPC5_PWM_USE_SMOD0) || defined(__DOXYGEN__)
#define SPC5_PWM_USE_SMOD0                  FALSE
#endif

/**
 * @brief   PWMD2 driver enable switch.
 * @details If set to @p TRUE the support for PWMD2 is included.
 * @note    The default is @p FALSE.
 */
#if !defined(SPC5_PWM_USE_SMOD1) || defined(__DOXYGEN__)
#define SPC5_PWM_USE_SMOD1                  FALSE
#endif

/**
 * @brief   PWMD3 driver enable switch.
 * @details If set to @p TRUE the support for PWMD3 is included.
 * @note    The default is @p FALSE.
 */
#if !defined(SPC5_PWM_USE_SMOD2) || defined(__DOXYGEN__)
#define SPC5_PWM_USE_SMOD2                  FALSE
#endif

/**
 * @brief   PWMD4 driver enable switch.
 * @details If set to @p TRUE the support for PWMD4 is included.
 * @note    The default is @p FALSE.
 */
#if !defined(SPC5_PWM_USE_SMOD3) || defined(__DOXYGEN__)
#define SPC5_PWM_USE_SMOD3                  FALSE
#endif

/**
 * @brief   FlexPWM0 synchronization enable switch.
 * @details If set to @p TRUE the FlexPWM0 synchronization is enabled.
 * @note    The default is @p FALSE.
 */
#if !defined(SPC5_PWM0_USE_SYNC_SMOD) || defined(__DOXYGEN__)
#define SPC5_PWM0_USE_SYNC_SMOD              FALSE
#endif

/**
 * @brief   PWMD1 interrupt priority level setting.
 */
#if !defined(SPC5_PWM_SMOD0_PRIORITY) || defined(__DOXYGEN__)
#define SPC5_PWM_SMOD0_PRIORITY             7
#endif

/**
 * @brief   PWMD2 interrupt priority level setting.
 */
#if !defined(SPC5_PWM_SMOD1_PRIORITY) || defined(__DOXYGEN__)
#define SPC5_PWM_SMOD1_PRIORITY             7
#endif

/**
 * @brief   PWMD3 interrupt priority level setting.
 */
#if !defined(SPC5_PWM_SMOD2_PRIORITY) || defined(__DOXYGEN__)
#define SPC5_PWM_SMOD2_PRIORITY             7
#endif

/**
 * @brief   PWMD4 interrupt priority level setting.
 */
#if !defined(SPC5_PWM_SMOD3_PRIORITY) || defined(__DOXYGEN__)
#define SPC5_PWM_SMOD3_PRIORITY             7
#endif

/**
 * @brief   FlexPWM-0 peripheral configuration when started.
 * @note    The default configuration is 1 (always run) in run mode and
 *          2 (only halt) in low power mode.
 */
#if !defined(SPC5_PWM_FLEXPWM0_START_PCTL) || defined(__DOXYGEN__)
#define SPC5_PWM_FLEXPWM0_START_PCTL        (SPC5_ME_PCTL_RUN(1) |          \
                                             SPC5_ME_PCTL_LP(2))
#endif

/**
 * @brief   FlexPWM-0 peripheral configuration when stopped.
 * @note    The default configuration is 0 (never run) in run mode and
 *          0 (never run) in low power mode.
 */
#if !defined(SPC5_PWM_FLEXPWM0_STOP_PCTL) || defined(__DOXYGEN__)
#define SPC5_PWM_FLEXPWM0_STOP_PCTL         (SPC5_ME_PCTL_RUN(0) |          \
                                             SPC5_ME_PCTL_LP(0))
#endif

/**
 * @brief   PWMD5 driver enable switch.
 * @details If set to @p TRUE the support for PWMD5 is included.
 * @note    The default is @p FALSE.
 */
#if !defined(SPC5_PWM_USE_SMOD4) || defined(__DOXYGEN__)
#define SPC5_PWM_USE_SMOD4                  FALSE
#endif

/**
 * @brief   PWMD6 driver enable switch.
 * @details If set to @p TRUE the support for PWMD6 is included.
 * @note    The default is @p FALSE.
 */
#if !defined(SPC5_PWM_USE_SMOD5) || defined(__DOXYGEN__)
#define SPC5_PWM_USE_SMOD5                  FALSE
#endif

/**
 * @brief   PWMD7 driver enable switch.
 * @details If set to @p TRUE the support for PWMD7 is included.
 * @note    The default is @p FALSE.
 */
#if !defined(SPC5_PWM_USE_SMOD6) || defined(__DOXYGEN__)
#define SPC5_PWM_USE_SMOD6                  FALSE
#endif

/**
 * @brief   PWMD8 driver enable switch.
 * @details If set to @p TRUE the support for PWMD8 is included.
 * @note    The default is @p FALSE.
 */
#if !defined(SPC5_PWM_USE_SMOD7) || defined(__DOXYGEN__)
#define SPC5_PWM_USE_SMOD7                  FALSE
#endif

/**
 * @brief   FlexPWM1 synchronization enable switch.
 * @details If set to @p TRUE the FlexPWM1 synchronization is enabled.
 * @note    The default is @p FALSE.
 */
#if !defined(SPC5_PWM1_USE_SYNC_SMOD) || defined(__DOXYGEN__)
#define SPC5_PWM1_USE_SYNC_SMOD              FALSE
#endif

/**
 * @brief   PWMD5 interrupt priority level setting.
 */
#if !defined(SPC5_PWM_SMOD4_PRIORITY) || defined(__DOXYGEN__)
#define SPC5_PWM_SMOD4_PRIORITY             7
#endif

/**
 * @brief   PWMD6 interrupt priority level setting.
 */
#if !defined(SPC5_PWM_SMOD5_PRIORITY) || defined(__DOXYGEN__)
#define SPC5_PWM_SMOD5_PRIORITY             7
#endif

/**
 * @brief   PWMD7 interrupt priority level setting.
 */
#if !defined(SPC5_PWM_SMOD6_PRIORITY) || defined(__DOXYGEN__)
#define SPC5_PWM_SMOD6_PRIORITY             7
#endif

/**
 * @brief   PWMD8 interrupt priority level setting.
 */
#if !defined(SPC5_PWM_SMOD7_PRIORITY) || defined(__DOXYGEN__)
#define SPC5_PWM_SMOD7_PRIORITY             7
#endif

/**
 * @brief   FlexPWM-1 peripheral configuration when started.
 * @note    The default configuration is 1 (always run) in run mode and
 *          2 (only halt) in low power mode.
 */
#if !defined(SPC5_PWM_FLEXPWM1_START_PCTL) || defined(__DOXYGEN__)
#define SPC5_PWM_FLEXPWM1_START_PCTL        (SPC5_ME_PCTL_RUN(1) |          \
                                             SPC5_ME_PCTL_LP(2))
#endif

/**
 * @brief   FlexPWM-1 peripheral configuration when stopped.
 * @note    The default configuration is 0 (never run) in run mode and
 *          0 (never run) in low power mode.
 */
#if !defined(SPC5_PWM_FLEXPWM1_STOP_PCTL) || defined(__DOXYGEN__)
#define SPC5_PWM_FLEXPWM1_STOP_PCTL         (SPC5_ME_PCTL_RUN(0) |          \
                                             SPC5_ME_PCTL_LP(0))
#endif

/**
 * @brief   PWMD9 driver enable switch.
 * @details If set to @p TRUE the support for PWMD9 is included.
 * @note    The default is @p FALSE.
 */
#if !defined(SPC5_PWM_USE_SMOD8) || defined(__DOXYGEN__)
#define SPC5_PWM_USE_SMOD8                  FALSE
#endif

/**
 * @brief   PWMD10 driver enable switch.
 * @details If set to @p TRUE the support for PWMD10 is included.
 * @note    The default is @p FALSE.
 */
#if !defined(SPC5_PWM_USE_SMOD9) || defined(__DOXYGEN__)
#define SPC5_PWM_USE_SMOD9                  FALSE
#endif

/**
 * @brief   PWMD11 driver enable switch.
 * @details If set to @p TRUE the support for PWMD11 is included.
 * @note    The default is @p FALSE.
 */
#if !defined(SPC5_PWM_USE_SMOD10) || defined(__DOXYGEN__)
#define SPC5_PWM_USE_SMOD10                 FALSE
#endif

/**
 * @brief   PWMD12 driver enable switch.
 * @details If set to @p TRUE the support for PWMD12 is included.
 * @note    The default is @p FALSE.
 */
#if !defined(SPC5_PWM_USE_SMOD11) || defined(__DOXYGEN__)
#define SPC5_PWM_USE_SMOD11                 FALSE
#endif

/**
 * @brief   FlexPWM2 synchronization enable switch.
 * @details If set to @p TRUE the FlexPWM1 synchronization is enabled.
 * @note    The default is @p FALSE.
 */
#if !defined(SPC5_PWM2_USE_SYNC_SMOD) || defined(__DOXYGEN__)
#define SPC5_PWM2_USE_SYNC_SMOD              FALSE
#endif

/**
 * @brief   PWMD9 interrupt priority level setting.
 */
#if !defined(SPC5_PWM_SMOD8_PRIORITY) || defined(__DOXYGEN__)
#define SPC5_PWM_SMOD8_PRIORITY             7
#endif

/**
 * @brief   PWMD10 interrupt priority level setting.
 */
#if !defined(SPC5_PWM_SMOD9_PRIORITY) || defined(__DOXYGEN__)
#define SPC5_PWM_SMOD9_PRIORITY             7
#endif

/**
 * @brief   PWMD11 interrupt priority level setting.
 */
#if !defined(SPC5_PWM_SMOD10_PRIORITY) || defined(__DOXYGEN__)
#define SPC5_PWM_SMOD10_PRIORITY            7
#endif

/**
 * @brief   PWMD12 interrupt priority level setting.
 */
#if !defined(SPC5_PWM_SMOD11_PRIORITY) || defined(__DOXYGEN__)
#define SPC5_PWM_SMOD11_PRIORITY            7
#endif

/**
 * @brief   FlexPWM-2 peripheral configuration when started.
 * @note    The default configuration is 1 (always run) in run mode and
 *          2 (only halt) in low power mode.
 */
#if !defined(SPC5_PWM_FLEXPWM2_START_PCTL) || defined(__DOXYGEN__)
#define SPC5_PWM_FLEXPWM2_START_PCTL        (SPC5_ME_PCTL_RUN(1) |          \
                                             SPC5_ME_PCTL_LP(2))
#endif

/**
 * @brief   FlexPWM-2 peripheral configuration when stopped.
 * @note    The default configuration is 0 (never run) in run mode and
 *          0 (never run) in low power mode.
 */
#if !defined(SPC5_PWM_FLEXPWM2_STOP_PCTL) || defined(__DOXYGEN__)
#define SPC5_PWM_FLEXPWM2_STOP_PCTL         (SPC5_ME_PCTL_RUN(0) |          \
                                             SPC5_ME_PCTL_LP(0))
#endif

/*===========================================================================*/
/* Configuration checks.                                                     */
/*===========================================================================*/

#if (SPC5_PWM_USE_SMOD0 == TRUE || SPC5_PWM_USE_SMOD1 == TRUE || \
     SPC5_PWM_USE_SMOD2 == TRUE || SPC5_PWM_USE_SMOD3 == TRUE)
#define SPC5_PWM_USE_FLEXPWM0               TRUE
#else
#define SPC5_PWM_USE_FLEXPWM0               FALSE
#endif

