MinhazRaufoon/ASE-Praktikum-Units/Unit 2/Lab/SPC56ELxx_RLA CAN Test Application for DiscoveryPlus/components/spc56elxx_low_level_drivers_component_rla/lib/include/pwm_lld.h
#if (SPC5_PWM_USE_SMOD4 == TRUE || SPC5_PWM_USE_SMOD5 == TRUE || \
     SPC5_PWM_USE_SMOD6 == TRUE || SPC5_PWM_USE_SMOD7 == TRUE)
#define SPC5_PWM_USE_FLEXPWM1               TRUE
#else
#define SPC5_PWM_USE_FLEXPWM1               FALSE
#endif

#if (SPC5_PWM_USE_SMOD8 == TRUE  || SPC5_PWM_USE_SMOD9 == TRUE  || \
     SPC5_PWM_USE_SMOD10 == TRUE || SPC5_PWM_USE_SMOD11 == TRUE)
#define SPC5_PWM_USE_FLEXPWM2               TRUE
#else
#define SPC5_PWM_USE_FLEXPWM2               FALSE
#endif

#if (SPC5_HAS_FLEXPWM0 == FALSE && SPC5_PWM_USE_FLEXPWM0 == TRUE)
#error "FlexPWM0 not present in the selected device"
#endif

#if (SPC5_HAS_FLEXPWM1 == FALSE && SPC5_PWM_USE_FLEXPWM1 == TRUE)
#error "FlexPWM1 not present in the selected device"
#endif

#if (SPC5_HAS_FLEXPWM2 == FALSE && SPC5_PWM_USE_FLEXPWM2 == TRUE)
#error "FlexPWM2 not present in the selected device"
#endif

#if (SPC5_PWM_USE_FLEXPWM0 == FALSE && SPC5_PWM_USE_FLEXPWM1 == FALSE && \
     SPC5_PWM_USE_FLEXPWM2 == FALSE)
#error "PWM driver activated but no PWM peripheral assigned"
#endif

#if (SPC5_PWM0_USE_SYNC_SMOD == TRUE && SPC5_PWM_USE_SMOD0 == FALSE)
#error "FlexPWM0 sm0 must be activated when FlexPWM0 submodule synchronization is activated"
#endif

#if (SPC5_PWM1_USE_SYNC_SMOD == TRUE && SPC5_PWM_USE_SMOD4 == FALSE)
#error "FlexPWM1 sm0 must be activated when FlexPWM1 submodule synchronization is activated"
#endif

#if (SPC5_PWM2_USE_SYNC_SMOD == TRUE && SPC5_PWM_USE_SMOD8 == FALSE)
#error "FlexPWM2 sm0 must be activated when FlexPWM2 submodule synchronization is activated"
#endif

/*===========================================================================*/
/* Driver data structures and types.                                         */
/*===========================================================================*/

/**
 * @brief   Type of a structure representing a PWM driver.
 */
typedef struct PWMDriver PWMDriver;

/**
 * @brief   PWM notification callback type.
 *
 * @param[in] pwmp      pointer to a @p PWMDriver object
 */
typedef void (*pwmcallback_t)(PWMDriver *pwmp);

/**
 * @brief   PWM mode type.
 */
typedef uint32_t pwmmode_t;

/**
 * @brief   PWM channel type.
 */
typedef uint8_t pwmchannel_t;

/**
 * @brief   PWM counter type.
 */
typedef uint16_t pwmcnt_t;

/**
 * @brief   PWM clock type.
 */
typedef uint32_t pwmclk_t;

/**
 * @brief   PWM driver channel configuration structure.
 */
typedef struct {
  /**
   * @brief Channel active logic level.
   */
  pwmmode_t                 mode;
  /**
   * @brief Channel callback pointer.
   * @note  This callback is invoked on the channel compare event. If set to
   *        @p NULL then the callback is disabled.
   */
  pwmcallback_t             callback;
  /* End of the mandatory fields.*/
} PWMChannelConfig;

/**
 * @brief   PWM driver configuration structure.
 */
typedef struct {
  /**
   * @brief Timer clock in Hz.
   */
  uint32_t                  frequency;
  /**
   * @brief PWM period in ticks.
   */
  pwmcnt_t                  period;
  /**
   * @brief Periodic callback pointer.
   * @note  This callback is invoked on PWM counter reset. If set to
   *        @p NULL then the callback is disabled.
   */
  pwmcallback_t             callback;
  /**
   * @brief Channels configurations.
   */
  PWMChannelConfig          channels[PWM_CHANNELS];
  /* End of the mandatory fields.*/
  /**
   * @brief PWM functional mode.
   */
  pwmmode_t                 mode;
} PWMConfig;

/**
 * @brief   Structure representing a PWM driver.
 */
struct PWMDriver {
  /**
   * @brief Current driver configuration data.
   */
  const PWMConfig           *config;
  /**
   * @brief Current PWM period in ticks.
   */
  pwmcnt_t                  period;
  /**
   * @brief PWM clock in Hz.
   */
  pwmclk_t                  clock;
#if defined(PWM_DRIVER_EXT_FIELDS)
  PWM_DRIVER_EXT_FIELDS
#endif
  /* End of the mandatory fields.*/
  /**
   * @brief Pointer to the volatile FlexPWM registers block.
   */
  volatile struct spc5_flexpwm *flexpwmp;
};

/*===========================================================================*/
/* Driver macros.                                                            */
/*===========================================================================*/

/**
 * @name    PWM duty cycle conversion
 * @{
 */
/**
 * @brief   Converts from fraction to pulse width.
 * @note    Be careful with rounding errors, this is integer math not magic.
 *          You can specify tenths of thousandth but make sure you have the
 *          proper hardware resolution by carefully choosing the clock source
 *          and prescaler settings, see @p PWM_COMPUTE_PSC.
 *
 * @param[in] pwmp      pointer to a @p PWMDriver object
 * @param[in] denominator denominator of the fraction
 * @param[in] numerator numerator of the fraction
 * @return              The pulse width to be passed to @p pwm_lld_enable_channel().
 *
 * @api
 */
#define PWM_FRACTION_TO_WIDTH(pwmp, denominator, numerator)                 \
  ((pwmcnt_t)((((pwmcnt_t)(pwmp)->period) *                                 \
               (pwmcnt_t)(numerator)) / (pwmcnt_t)(denominator)))

/**
 * @brief   Converts from degrees to pulse width.
 * @note    Be careful with rounding errors, this is integer math not magic.
 *          You can specify hundredths of degrees but make sure you have the
 *          proper hardware resolution by carefully choosing the clock source
 *          and prescaler settings, see @p PWM_COMPUTE_PSC.
 *
 * @param[in] pwmp      pointer to a @p PWMDriver object
 * @param[in] degrees   degrees as an integer between 0 and 36000
 * @return              The pulse width to be passed to @p pwm_lld_enable_channel().
 *
 * @api
 */
#define PWM_DEGREES_TO_WIDTH(pwmp, degrees)                                 \
  PWM_FRACTION_TO_WIDTH(pwmp, 36000, degrees)

/**
 * @brief   Converts from percentage to pulse width.
 * @note    Be careful with rounding errors, this is integer math not magic.
 *          You can specify tenths of thousandth but make sure you have the
 *          proper hardware resolution by carefully choosing the clock source
 *          and prescaler settings, see @p PWM_COMPUTE_PSC.
 *
 * @param[in] pwmp      pointer to a @p PWMDriver object
 * @param[in] percentage percentage as an integer between 0 and 10000
 * @return              The pulse width to be passed to @p pwm_lld_enable_channel().
 *
 * @api
 */
#define PWM_PERCENTAGE_TO_WIDTH(pwmp, percentage)                           \
  PWM_FRACTION_TO_WIDTH(pwmp, 10000, percentage)
/** @} */

/*===========================================================================*/
/* IRQ Handlers                                                              */
/*===========================================================================*/

#if (SPC5_PWM_USE_SMOD0 == TRUE) || defined(__DOXYGEN__)
IRQ_HANDLER(SPC5_FLEXPWM0_RF0_HANDLER) ;
IRQ_HANDLER(SPC5_FLEXPWM0_COF0_HANDLER);
#endif

