MinhazRaufoon/ASE-Praktikum-Units/Unit 2/Lab/SPC56ELxx_RLA CAN Test Application for DiscoveryPlus/components/spc56elxx_low_level_drivers_component_rla/lib/include/pwm_lld.h
#if (SPC5_PWM_USE_SMOD1 == TRUE) || defined(__DOXYGEN__)
#if (SPC5_PWM0_USE_SYNC_SMOD == FALSE)
IRQ_HANDLER(SPC5_FLEXPWM0_RF1_HANDLER);
#endif
IRQ_HANDLER(SPC5_FLEXPWM0_COF1_HANDLER);
#endif

#if (SPC5_PWM_USE_SMOD2 == TRUE) || defined(__DOXYGEN__)
#if (SPC5_PWM0_USE_SYNC_SMOD == FALSE)
IRQ_HANDLER(SPC5_FLEXPWM0_RF2_HANDLER);
#endif
IRQ_HANDLER(SPC5_FLEXPWM0_COF2_HANDLER);
#endif

#if (SPC5_PWM_USE_SMOD3 == TRUE) || defined(__DOXYGEN__)
#if (SPC5_PWM0_USE_SYNC_SMOD == FALSE)
IRQ_HANDLER(SPC5_FLEXPWM0_RF3_HANDLER);
#endif
IRQ_HANDLER(SPC5_FLEXPWM0_COF3_HANDLER);
#endif

#if (SPC5_PWM_USE_SMOD4 == TRUE) || defined(__DOXYGEN__)
IRQ_HANDLER(SPC5_FLEXPWM1_RF0_HANDLER);
IRQ_HANDLER(SPC5_FLEXPWM1_COF0_HANDLER);
#endif

#if (SPC5_PWM_USE_SMOD5 == TRUE) || defined(__DOXYGEN__)
#if (SPC5_PWM1_USE_SYNC_SMOD == FALSE)
IRQ_HANDLER(SPC5_FLEXPWM1_RF1_HANDLER);
#endif
IRQ_HANDLER(SPC5_FLEXPWM1_COF1_HANDLER);
#endif

#if (SPC5_PWM_USE_SMOD6 == TRUE) || defined(__DOXYGEN__)
#if (SPC5_PWM1_USE_SYNC_SMOD == FALSE)
IRQ_HANDLER(SPC5_FLEXPWM1_RF2_HANDLER);
#endif
IRQ_HANDLER(SPC5_FLEXPWM1_COF2_HANDLER);
#endif

#if (SPC5_PWM_USE_SMOD7 == TRUE) || defined(__DOXYGEN__)
#if (SPC5_PWM1_USE_SYNC_SMOD == FALSE)
IRQ_HANDLER(SPC5_FLEXPWM1_RF3_HANDLER);
#endif
IRQ_HANDLER(SPC5_FLEXPWM1_COF3_HANDLER);
#endif

#if (SPC5_PWM_USE_SMOD8 == TRUE) || defined(__DOXYGEN__)
IRQ_HANDLER(SPC5_FLEXPWM2_RF0_HANDLER);
IRQ_HANDLER(SPC5_FLEXPWM2_COF0_HANDLER);
#endif

#if (SPC5_PWM_USE_SMOD9 == TRUE) || defined(__DOXYGEN__)
#if (SPC5_PWM2_USE_SYNC_SMOD == FALSE)
IRQ_HANDLER(SPC5_FLEXPWM2_RF1_HANDLER);
#endif
IRQ_HANDLER(SPC5_FLEXPWM2_COF1_HANDLER);
#endif

#if (SPC5_PWM_USE_SMOD10 == TRUE) || defined(__DOXYGEN__)
#if (SPC5_PWM2_USE_SYNC_SMOD == FALSE)
IRQ_HANDLER(SPC5_FLEXPWM2_RF2_HANDLER);
#endif
IRQ_HANDLER(SPC5_FLEXPWM2_COF2_HANDLER);
#endif

#if (SPC5_PWM_USE_SMOD11 == TRUE) || defined(__DOXYGEN__)
#if (SPC5_PWM2_USE_SYNC_SMOD == FALSE)
IRQ_HANDLER(SPC5_FLEXPWM2_RF3_HANDLER);
#endif
IRQ_HANDLER(SPC5_FLEXPWM2_COF3_HANDLER);
#endif

/*===========================================================================*/
/* External declarations.                                                    */
/*===========================================================================*/

#if (SPC5_PWM_USE_SMOD0 == TRUE) && !defined(__DOXYGEN__)
extern PWMDriver PWMD1;
#endif

#if (SPC5_PWM_USE_SMOD1 == TRUE && SPC5_PWM0_USE_SYNC_SMOD == FALSE) || defined(__DOXYGEN__)
extern PWMDriver PWMD2;
#endif

#if (SPC5_PWM_USE_SMOD2 == TRUE && SPC5_PWM0_USE_SYNC_SMOD == FALSE) || defined(__DOXYGEN__)
extern PWMDriver PWMD3;
#endif

#if (SPC5_PWM_USE_SMOD3 == TRUE && SPC5_PWM0_USE_SYNC_SMOD == FALSE) || defined(__DOXYGEN__)
extern PWMDriver PWMD4;
#endif

#if (SPC5_PWM_USE_SMOD4 == TRUE) && !defined(__DOXYGEN__)
extern PWMDriver PWMD5;
#endif

#if (SPC5_PWM_USE_SMOD5 == TRUE && SPC5_PWM1_USE_SYNC_SMOD == FALSE) || defined(__DOXYGEN__)
extern PWMDriver PWMD6;
#endif

#if (SPC5_PWM_USE_SMOD6 == TRUE && SPC5_PWM1_USE_SYNC_SMOD == FALSE) || defined(__DOXYGEN__)
extern PWMDriver PWMD7;
#endif

#if (SPC5_PWM_USE_SMOD7 == TRUE && SPC5_PWM1_USE_SYNC_SMOD == FALSE) || defined(__DOXYGEN__)
extern PWMDriver PWMD8;
#endif

#if (SPC5_PWM_USE_SMOD8 == TRUE) && !defined(__DOXYGEN__)
extern PWMDriver PWMD9;
#endif

#if (SPC5_PWM_USE_SMOD9 == TRUE && SPC5_PWM2_USE_SYNC_SMOD == FALSE) || defined(__DOXYGEN__)
extern PWMDriver PWMD10;
#endif

#if (SPC5_PWM_USE_SMOD10 == TRUE && SPC5_PWM2_USE_SYNC_SMOD == FALSE) || defined(__DOXYGEN__)
extern PWMDriver PWMD11;
#endif

#if (SPC5_PWM_USE_SMOD11 == TRUE && SPC5_PWM2_USE_SYNC_SMOD == FALSE) || defined(__DOXYGEN__)
extern PWMDriver PWMD12;
#endif

#ifdef __cplusplus
extern "C" {
#endif
  void pwm_lld_init(void);
  void pwm_lld_start(PWMDriver *pwmp, const PWMConfig *config);
  void pwm_lld_stop(PWMDriver *pwmp);
  void pwm_lld_enable_channel(PWMDriver *pwmp,
                              pwmchannel_t channel,
                              pwmcnt_t width);
  void pwm_lld_disable_channel(PWMDriver *pwmp, pwmchannel_t channel);
  void pwm_lld_change_period(PWMDriver *pwmp, pwmcnt_t period);
#ifdef __cplusplus
}
#endif

#endif /* LLD_USE_PWM */

#endif /* _PWM_LLD_H_ */

/** @} */
